admin/meeting-notes/2012-02-07.org
* Meeting Notes 2012-02-07
** Location
   - We're in the Sky Lounge.
     - There are so many buttons to push!
       - The shades go up.
       - John sings the theme from 2001.
    - Mish attempts to connect Jon's laptop to the projector.
      - *John* : It's got a ThunderWire or something.
    - *Andrew* : This is my favorite room in the entire building.
** Emacs Starter Kit
   - The projector is a fullscreen emacs buffer, occasionally interrupted by
     Growl notifications.
     - *Andrew* : Are you a fan of my scratch buffer?
     - Pulak Mittal connected.
   - *Andrew* : You're going to want to go to this URL.
     - *John* : What if I don't want to?
     - *Andrew* : Technomancy. It's a pretty good name.
   - *Andrew* : Emacs current version is 23. Starter kit is designed for 24.
     - *John* : Emacs 24 introduces lexical scoping. It's going to break so
                much stuff, or make everything easier to write.
   - *Andrew* : This is my ~/.emacs.d. It's a little unorganized.
     - *Mish* : Looks like mine!
   - *Andrew* : It'll make sure our emacs sessions load fast--
     - *Mac OS X* : emacs has unexpectedly quit.
     - *Andrew* : --and don't crash unexpectedly.
   - *Andrew* : This is why it's good that it's source and not compiled binary, you can change it.
     - *John* : RMS reference. Everyone, take a shot.
   - Andrew pronounces magit in at least 3 different ways.
*** ido-mode
    - *Andrew* : I was trying to beat ido-mode to name the file.
    - ido-mode will look for substrings, not just prefixes.
      - *Andrew* : This is actually the biggest reason I switched to zsh.
    - *Mish* : It has also made a visual bell.
      - *John* : Woof woof? Is that screen?
      - *Mish* : It's kind of an ugly-looking block.
    - *Mish* : If you type .js will it autocomplete to all your .js files?
      - Andrew tries it. It autocompletes to rdtrippin.js.
** General Life Advice
   - *Andrew* : The other thing you should all know is C-g.
     - *John* : I really want to remap it to C-O m g.
** elnode
   - *John* : At the bottom is an emacs buffer, and at the top--
     - Someone goes to emacsclub.com
     - *John* : Oh, someone just hit it. That's the server log. OK, everyone go to emacsclub.com.
     - Andrew stress-tests emacsclub.com.
       - *Andrew* : Whooooooooooo!
     - John stops the server, because he can't explain elnode with the running server logs.
     - *John* : Just kidding, I'll start it up again.
   - John defun's start. It logs an error.
     - *John* : I don't really use this function.
   - *John* : There's not much to say. This is more of a show and tell thing.
** org-mode
   - *Mish* : Try to follow along, because what you're about to learn
              is the most important thing ever in emacs.
     - The guy who just left is missing out.
   - *John* : I bet I have a foo.org somewhere. Yes!
     - ido to the rescue.
   - *Mish* : If you don't like shortcuts, you can type in "TODO" and it'll
              recognize it. But you should like shortcuts.
   - John is overriding important things.
   - Mish looks through his applications. On the projector, they're huge.
   - *John* : What's that ~#+begin_example~ stuff?
     - *Mish* : I'll get to it later. Just forget anything with a hash before it.
     - *Zach* : Your mind is too weak for it. You would be crushed under
                the power.
  - *Mish* : Then press tab. Whup! You have a table.
  - *Zach* : Do they support formulas, Mish?
    - *Mish* : Yep!
  - *Mish* : If you ~|-~ right away, it'll just give you a table.
  - Mish shows off syntax highlighting.
    - *Zach* : God, that's sexy.
  - *Mish* : Some HTML pages like to render their quotes with big quote
             marks in the top-left and bottom-right.
  - *Mish* : It's easy to make HTML files that are well-structured even if
             they're ugly.
    - This ugliness must be fixed. Zach's thinking Bootstrap.
      - *Andrew* : Everyone was thinking Bootstrap.
  - Mish shows index.html. It has the Levitating Meditating Flute-Playing GNU.
    - *Mish* : It's just a test!
  - *Mish* : These are the OPTIONS options! They're options with an OPTIONS
             keyword. There are lots of options you can give to the OPTIONS
             options.
    - *Mish* : I don't know what any of these do.
  - org exports some stylesheet junk.
    - *Mish* : I don't really know what CSS does... whatever these do.
  - Mish commits a temp file.
    - Zach complains about the OSX junk that get committed if you
      commit everything.
  - *Andrew* : org-mode's way more baller than I thought.
  - *Mish* : That was only 15% of org mode, or less.
    - *Zach* : It's a whole universe.
** Blinkenlights
   - *Zach* : You forgot M-x zone.
   - If you hold down * in org-mode it blinks colors as it changes
     the heading level.
     - ~************** [===](^..^)    <( NYANYANYAN )~
** Misc
   - *John* : I'm going vanilla.
   - *Mish* : It's not cheating to use a mouse.
     - *Andrew* : Yes. Yes it is. 
   - *Andrew* : Whose dongle is that?
     - *Mish* : That's my dongle.
     - *Andrew* : Don't forget your dongle.
   - John has an administrative todo.
     - *Andrew* : You should mark it TODO.
   - People are going through the emacs tutorial, right?
     - *Zach* : I guess I only did the tutorial because it was homework for
                Perry's class.
   - *Andrew* : Whose dongle cover is this?
   - We're going to have M-x skybox automate the shades in the Sky Lounge.
   - Andrew once accidentally his backpack in the elevator and it hit the
     emergency button.
