content/html/meeting-notes/2012-02-07.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Meeting Notes 2012-02-07</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Meeting Notes 2012-02-07"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-04-25 19:18:24 EDT"/>
<meta name="author" content="Matt Croop"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />
<link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="sitemap.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Meeting Notes 2012-02-07</h1>


<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-30426956-1']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>




<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Location</a></li>
<li><a href="#sec-2">Emacs Starter Kit</a>
<ul>
<li><a href="#sec-2-1">ido-mode</a></li>
</ul>
</li>
<li><a href="#sec-3">General Life Advice</a></li>
<li><a href="#sec-4">elnode</a></li>
<li><a href="#sec-5">org-mode</a></li>
<li><a href="#sec-6">Blinkenlights</a></li>
<li><a href="#sec-7">Misc</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Location</h2>
<div class="outline-text-2" id="text-1">

<ul>
<li>We're in the Sky Lounge.
<ul>
<li>There are so many buttons to push!
<ul>
<li>The shades go up.
</li>
<li>John sings the theme from 2001.
</li>
</ul>

</li>
<li>Mish attempts to connect Jon's laptop to the projector.
<ul>
<li><b>John</b> : It's got a ThunderWire or something.
</li>
</ul>

</li>
<li><b>Andrew</b> : This is my favorite room in the entire building.
</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Emacs Starter Kit</h2>
<div class="outline-text-2" id="text-2">

<ul>
<li>The projector is a fullscreen emacs buffer, occasionally interrupted by
    Growl notifications.
<ul>
<li><b>Andrew</b> : Are you a fan of my scratch buffer?
</li>
<li>Pulak Mittal connected.
</li>
</ul>

</li>
<li><b>Andrew</b> : You're going to want to go to this URL.
<ul>
<li><b>John</b> : What if I don't want to?
</li>
<li><b>Andrew</b> : Technomancy. It's a pretty good name.
</li>
</ul>

</li>
<li><b>Andrew</b> : Emacs current version is 23. Starter kit is designed for 24.
<ul>
<li><b>John</b> : Emacs 24 introduces lexical scoping. It's going to break so
               much stuff, or make everything easier to write.
</li>
</ul>

</li>
<li><b>Andrew</b> : This is my ~/.emacs.d. It's a little unorganized.
<ul>
<li><b>Mish</b> : Looks like mine!
</li>
</ul>

</li>
<li><b>Andrew</b> : It'll make sure our emacs sessions load fast--
<ul>
<li><b>Mac OS X</b> : emacs has unexpectedly quit.
</li>
<li><b>Andrew</b> : &ndash;and don't crash unexpectedly.
</li>
</ul>

</li>
<li><b>Andrew</b> : This is why it's good that it's source and not compiled binary, you can change it.
<ul>
<li><b>John</b> : RMS reference. Everyone, take a shot.
</li>
</ul>

</li>
<li>Andrew pronounces magit in at least 3 different ways.
</li>
</ul>


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1">ido-mode</h3>
<div class="outline-text-3" id="text-2-1">

<ul>
<li><b>Andrew</b> : I was trying to beat ido-mode to name the file.
</li>
<li>ido-mode will look for substrings, not just prefixes.
<ul>
<li><b>Andrew</b> : This is actually the biggest reason I switched to zsh.
</li>
</ul>

</li>
<li><b>Mish</b> : It has also made a visual bell.
<ul>
<li><b>John</b> : Woof woof? Is that screen?
</li>
<li><b>Mish</b> : It's kind of an ugly-looking block.
</li>
</ul>

</li>
<li><b>Mish</b> : If you type .js will it autocomplete to all your .js files?
<ul>
<li>Andrew tries it. It autocompletes to rdtrippin.js.
</li>
</ul>

</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">General Life Advice</h2>
<div class="outline-text-2" id="text-3">

<ul>
<li><b>Andrew</b> : The other thing you should all know is C-g.
<ul>
<li><b>John</b> : I really want to remap it to C-O m g.
</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">elnode</h2>
<div class="outline-text-2" id="text-4">

<ul>
<li><b>John</b> : At the bottom is an emacs buffer, and at the top--
<ul>
<li>Someone goes to emacsclub.com
</li>
<li><b>John</b> : Oh, someone just hit it. That's the server log. OK, everyone go to emacsclub.com.
</li>
<li>Andrew stress-tests emacsclub.com.
<ul>
<li><b>Andrew</b> : Whooooooooooo!
</li>
</ul>

</li>
<li>John stops the server, because he can't explain elnode with the running server logs.
</li>
<li><b>John</b> : Just kidding, I'll start it up again.
</li>
</ul>

</li>
<li>John defun's start. It logs an error.
<ul>
<li><b>John</b> : I don't really use this function.
</li>
</ul>

</li>
<li><b>John</b> : There's not much to say. This is more of a show and tell thing.
</li>
</ul>

</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">org-mode</h2>
<div class="outline-text-2" id="text-5">

<ul>
<li><b>Mish</b> : Try to follow along, because what you're about to learn
             is the most important thing ever in emacs.
<ul>
<li>The guy who just left is missing out.
</li>
</ul>

</li>
<li><b>John</b> : I bet I have a foo.org somewhere. Yes!
<ul>
<li>ido to the rescue.
</li>
</ul>

</li>
<li><b>Mish</b> : If you don't like shortcuts, you can type in "TODO" and it'll
             recognize it. But you should like shortcuts.
</li>
<li>John is overriding important things.
</li>
<li>Mish looks through his applications. On the projector, they're huge.
</li>
<li><b>John</b> : What's that <code>#+begin_example</code> stuff?
<ul>
<li><b>Mish</b> : I'll get to it later. Just forget anything with a hash before it.
</li>
<li><b>Zach</b> : Your mind is too weak for it. You would be crushed under
               the power.
</li>
</ul>

</li>
<li><b>Mish</b> : Then press tab. Whup! You have a table.
</li>
<li><b>Zach</b> : Do they support formulas, Mish?
<ul>
<li><b>Mish</b> : Yep!
</li>
</ul>

</li>
<li><b>Mish</b> : If you <code>|-</code> right away, it'll just give you a table.
</li>
<li>Mish shows off syntax highlighting.
<ul>
<li><b>Zach</b> : God, that's sexy.
</li>
</ul>

</li>
<li><b>Mish</b> : Some HTML pages like to render their quotes with big quote
            marks in the top-left and bottom-right.
</li>
<li><b>Mish</b> : It's easy to make HTML files that are well-structured even if
            they're ugly.
<ul>
<li>This ugliness must be fixed. Zach's thinking Bootstrap.
<ul>
<li><b>Andrew</b> : Everyone was thinking Bootstrap.
</li>
</ul>

</li>
</ul>

</li>
<li>Mish shows index.html. It has the Levitating Meditating Flute-Playing GNU.
<ul>
<li><b>Mish</b> : It's just a test!
</li>
</ul>

</li>
<li><b>Mish</b> : These are the OPTIONS options! They're options with an OPTIONS
            keyword. There are lots of options you can give to the OPTIONS
            options.
<ul>
<li><b>Mish</b> : I don't know what any of these do.
</li>
</ul>

</li>
<li>org exports some stylesheet junk.
<ul>
<li><b>Mish</b> : I don't really know what CSS does&hellip; whatever these do.
</li>
</ul>

</li>
<li>Mish commits a temp file.
<ul>
<li>Zach complains about the OSX junk that get committed if you
     commit everything.
</li>
</ul>

</li>
<li><b>Andrew</b> : org-mode's way more baller than I thought.
</li>
<li><b>Mish</b> : That was only 15% of org mode, or less.
<ul>
<li><b>Zach</b> : It's a whole universe.
</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6">Blinkenlights</h2>
<div class="outline-text-2" id="text-6">

<ul>
<li><b>Zach</b> : You forgot M-x zone.
</li>
<li>If you hold down * in org-mode it blinks colors as it changes
    the heading level.
<ul>
<li><code>************** [===](^..^)    &lt;( NYANYANYAN )</code>
</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7">Misc</h2>
<div class="outline-text-2" id="text-7">

<ul>
<li><b>John</b> : I'm going vanilla.
</li>
<li><b>Mish</b> : It's not cheating to use a mouse.
<ul>
<li><b>Andrew</b> : Yes. Yes it is. 
</li>
</ul>

</li>
<li><b>Andrew</b> : Whose dongle is that?
<ul>
<li><b>Mish</b> : That's my dongle.
</li>
<li><b>Andrew</b> : Don't forget your dongle.
</li>
</ul>

</li>
<li>John has an administrative todo.
<ul>
<li><b>Andrew</b> : You should mark it TODO.
</li>
</ul>

</li>
<li>People are going through the emacs tutorial, right?
<ul>
<li><b>Zach</b> : I guess I only did the tutorial because it was homework for
               Perry's class.
</li>
</ul>

</li>
<li><b>Andrew</b> : Whose dongle cover is this?
</li>
<li>We're going to have M-x skybox automate the shades in the Sky Lounge.
</li>
<li>Andrew once accidentally his backpack in the elevator and it hit the
    emergency button.
</li>
</ul>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-04-25 19:18:24 EDT</p>
<p class="author">Author: Matt Croop</p>
<p class="creator">Org version 7.8.09 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
